{
	//All paths must end in a directory separator(/ on Mac/linux or \ on windows.)
	//Because this is JSON, the backslash is treated as an escape character so you need to write \\ instead.
	"mindustryJars": {
		//A folder containing the .jar files for each version.
		"folderPath": "C:\\Mindustry\\Versions\\",
		"customVersionNames": {
			//List mapping your custom version names to paths. If the filename does not contain a / or \\, folderPath is prepended.
			//Format: "theVersionNameYouType": "theFileName.jar",
			//To launch theFileName.jar, you would choose version theVersionNameYouType.
			// "wack": "C:\\someWeirdPath\\fileName.jar"
			//You can also point it to a Mindustry source directory, like this:
			// "src": "C:\\Mindustry\\src\\Mindustry\\"
			//and if you specify the --compile flag it'll compile for you.
		}
	},
	"jvmArgs": [
		//Memory allocation, minimum 1G and maximum 2G.
		"-Xmx2G",
		"-Xms1G",
		//JVM arguments, don't touch if you don't understand.
		"-Dhttps.protocols=TLSv1.2,TLSv1.1,TLSv1",
		"-Dpolicone",
		"-XX:+ShowCodeDetailsInExceptionMessages"
	],
	"processArgs": [
		//List of args to pass to the actual process. Not sure why you would want this.
	],
	"externalMods": [
		//List of external mods to copy into the mods folder automatically when the file changes.
	],
	//Will restart Mindustry whenever a mod file changes. May be very annoying. May cause you to lose progress in a world.
	"restartAutomaticallyOnModUpdate": false,
	//Whether to watch the entire java mod directory instead of just the built jar.
	"watchWholeJavaModDirectory": false,
	"buildModsConcurrently": false,
	"logging": {
		//If you want to enable logging, change "enabled" to true, and change the path to where you want to put logs.
		"path": "C:\\Mindustry\\logs\\",
		"enabled": false,
		
		//Removes your (windows)username from logs. Useful if it's your IRL name and you don't want it to show up in screenshots.
		"removeUsername": true,
		//Removes everything that looks like a UUID from logs (but not console output).
		"removeUUIDs": true
	}
}
